AWS_RedisCluster/6_redis/2Stress_cpu8.txt
====== PING_INLINE ======
  100000 requests completed in 7.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
5.49% <= 2 milliseconds
26.19% <= 3 milliseconds
62.35% <= 4 milliseconds
88.43% <= 5 milliseconds
98.30% <= 6 milliseconds
99.88% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 203 milliseconds
13458.95 requests per second

====== PING_BULK ======
  100000 requests completed in 7.44 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
1.97% <= 2 milliseconds
24.63% <= 3 milliseconds
65.14% <= 4 milliseconds
92.04% <= 5 milliseconds
98.69% <= 6 milliseconds
99.78% <= 7 milliseconds
99.93% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 205 milliseconds
100.00% <= 205 milliseconds
13435.44 requests per second

====== SET ======
  100000 requests completed in 7.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
8.15% <= 2 milliseconds
34.07% <= 3 milliseconds
66.99% <= 4 milliseconds
88.88% <= 5 milliseconds
97.73% <= 6 milliseconds
99.65% <= 7 milliseconds
99.86% <= 8 milliseconds
99.94% <= 9 milliseconds
99.97% <= 10 milliseconds
99.99% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 206 milliseconds
14005.60 requests per second

====== GET ======
  100000 requests completed in 6.54 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
12.53% <= 2 milliseconds
47.74% <= 3 milliseconds
76.45% <= 4 milliseconds
91.90% <= 5 milliseconds
98.14% <= 6 milliseconds
99.65% <= 7 milliseconds
99.87% <= 8 milliseconds
99.94% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 204 milliseconds
100.00% <= 206 milliseconds
100.00% <= 210 milliseconds
100.00% <= 210 milliseconds
15290.52 requests per second

====== INCR ======
  100000 requests completed in 5.74 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
17.88% <= 2 milliseconds
66.95% <= 3 milliseconds
89.39% <= 4 milliseconds
96.14% <= 5 milliseconds
98.83% <= 6 milliseconds
99.57% <= 7 milliseconds
99.63% <= 8 milliseconds
99.64% <= 9 milliseconds
99.65% <= 10 milliseconds
99.65% <= 11 milliseconds
99.67% <= 12 milliseconds
99.71% <= 13 milliseconds
99.80% <= 14 milliseconds
99.87% <= 15 milliseconds
99.94% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 18 milliseconds
17409.47 requests per second

====== LPUSH ======
  100000 requests completed in 7.56 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
6.89% <= 2 milliseconds
30.62% <= 3 milliseconds
62.25% <= 4 milliseconds
86.08% <= 5 milliseconds
95.87% <= 6 milliseconds
98.47% <= 7 milliseconds
99.05% <= 8 milliseconds
99.19% <= 9 milliseconds
99.26% <= 10 milliseconds
99.36% <= 11 milliseconds
99.45% <= 12 milliseconds
99.60% <= 13 milliseconds
99.73% <= 14 milliseconds
99.83% <= 15 milliseconds
99.93% <= 16 milliseconds
99.97% <= 17 milliseconds
99.99% <= 18 milliseconds
100.00% <= 206 milliseconds
100.00% <= 207 milliseconds
100.00% <= 209 milliseconds
13224.02 requests per second

====== RPUSH ======
  100000 requests completed in 7.58 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
6.87% <= 2 milliseconds
26.68% <= 3 milliseconds
60.37% <= 4 milliseconds
85.39% <= 5 milliseconds
96.66% <= 6 milliseconds
99.21% <= 7 milliseconds
99.53% <= 8 milliseconds
99.66% <= 9 milliseconds
99.75% <= 10 milliseconds
99.80% <= 11 milliseconds
99.85% <= 12 milliseconds
99.90% <= 13 milliseconds
99.93% <= 14 milliseconds
99.95% <= 15 milliseconds
99.97% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 204 milliseconds
100.00% <= 207 milliseconds
13187.39 requests per second

====== LPOP ======
  100000 requests completed in 5.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
15.23% <= 2 milliseconds
59.26% <= 3 milliseconds
85.01% <= 4 milliseconds
95.52% <= 5 milliseconds
99.19% <= 6 milliseconds
99.89% <= 7 milliseconds
99.97% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 203 milliseconds
100.00% <= 206 milliseconds
100.00% <= 206 milliseconds
16702.86 requests per second

====== RPOP ======
  100000 requests completed in 6.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
8.75% <= 2 milliseconds
36.86% <= 3 milliseconds
72.48% <= 4 milliseconds
92.59% <= 5 milliseconds
98.56% <= 6 milliseconds
99.73% <= 7 milliseconds
99.88% <= 8 milliseconds
99.94% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
14539.11 requests per second

====== SADD ======
  100000 requests completed in 6.22 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
13.86% <= 2 milliseconds
52.93% <= 3 milliseconds
81.68% <= 4 milliseconds
94.79% <= 5 milliseconds
99.05% <= 6 milliseconds
99.91% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 202 milliseconds
100.00% <= 203 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
100.00% <= 206 milliseconds
16072.00 requests per second

====== HSET ======
  100000 requests completed in 6.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
13.61% <= 2 milliseconds
55.65% <= 3 milliseconds
81.50% <= 4 milliseconds
92.53% <= 5 milliseconds
97.34% <= 6 milliseconds
99.06% <= 7 milliseconds
99.52% <= 8 milliseconds
99.67% <= 9 milliseconds
99.76% <= 10 milliseconds
99.79% <= 11 milliseconds
99.84% <= 12 milliseconds
99.88% <= 13 milliseconds
99.91% <= 14 milliseconds
99.94% <= 15 milliseconds
99.95% <= 17 milliseconds
99.96% <= 18 milliseconds
99.97% <= 19 milliseconds
99.99% <= 20 milliseconds
100.00% <= 211 milliseconds
15780.34 requests per second

====== SPOP ======
  100000 requests completed in 7.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
8.82% <= 2 milliseconds
35.05% <= 3 milliseconds
67.40% <= 4 milliseconds
89.11% <= 5 milliseconds
97.77% <= 6 milliseconds
99.51% <= 7 milliseconds
99.72% <= 8 milliseconds
99.84% <= 9 milliseconds
99.94% <= 10 milliseconds
99.95% <= 11 milliseconds
99.95% <= 16 milliseconds
99.95% <= 17 milliseconds
99.96% <= 19 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
14041.00 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 5.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
21.60% <= 2 milliseconds
79.42% <= 3 milliseconds
97.60% <= 4 milliseconds
99.51% <= 5 milliseconds
99.92% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 204 milliseconds
19554.17 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 5.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
22.09% <= 2 milliseconds
82.12% <= 3 milliseconds
98.84% <= 4 milliseconds
99.89% <= 5 milliseconds
99.94% <= 6 milliseconds
99.95% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 203 milliseconds
19940.18 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
15.90% <= 2 milliseconds
64.35% <= 3 milliseconds
89.22% <= 4 milliseconds
96.26% <= 5 milliseconds
98.82% <= 6 milliseconds
99.57% <= 7 milliseconds
99.82% <= 8 milliseconds
99.89% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.95% <= 12 milliseconds
99.96% <= 13 milliseconds
99.97% <= 15 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
17185.08 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 6.53 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
11.80% <= 2 milliseconds
48.05% <= 3 milliseconds
77.37% <= 4 milliseconds
91.97% <= 5 milliseconds
98.22% <= 6 milliseconds
99.69% <= 7 milliseconds
99.86% <= 8 milliseconds
99.93% <= 9 milliseconds
99.97% <= 10 milliseconds
99.99% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 204 milliseconds
15320.97 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
9.40% <= 2 milliseconds
50.63% <= 3 milliseconds
83.82% <= 4 milliseconds
95.68% <= 5 milliseconds
98.92% <= 6 milliseconds
99.73% <= 7 milliseconds
99.95% <= 8 milliseconds
99.98% <= 10 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
15671.52 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 6.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
7.64% <= 2 milliseconds
40.96% <= 3 milliseconds
75.37% <= 4 milliseconds
92.57% <= 5 milliseconds
97.94% <= 6 milliseconds
99.55% <= 7 milliseconds
99.79% <= 8 milliseconds
99.83% <= 9 milliseconds
99.85% <= 13 milliseconds
99.85% <= 14 milliseconds
99.88% <= 15 milliseconds
99.95% <= 16 milliseconds
99.98% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 204 milliseconds
100.00% <= 206 milliseconds
100.00% <= 206 milliseconds
14624.16 requests per second