AWS_RedisCluster/6_redis/2Stress_hdd4.txt
19241.87 requests per second